cps-converter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-02 Fri 10:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>自动 CPS 变换</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">自动 CPS 变换</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfd5f21d">前言</a></li>
<li><a href="#org04d248a">简单的CPS变换</a></li>
<li><a href="#orgf5acf56">最简CPS输出</a></li>
<li><a href="#orge0c8219">简化 <code>cps1</code> 函数</a></li>
<li><a href="#orga5f69e4">多参数和原生函数</a></li>
<li><a href="#org4a3a1f2"><code>if</code> 语句</a></li>
<li><a href="#orge7c93b1">总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd5f21d" class="outline-2">
<h2 id="orgfd5f21d">前言</h2>
<div class="outline-text-2" id="text-orgfd5f21d">
<p>
我最一开始听到 CPS 变换这个词是在王垠的博客里
(请求不要喷我)，就是那篇他第一次宣传他的40行代码的文章。
我当时什么都看不懂，所以没太注意，不过我也正在学程序语言方面的东西，
不久我就在 EOPL 和 The Little Schemer 里面又见到了 CPS。
我有点不服气，知道了 CPS 不过就是这么个东西，
于是我也开始想自己重造王垠40行代码，然后我很惊讶地也花了
刚好一个星期写了出来，而且还基本上跟他的一模一样&#x2026;&#x2026;
</p>

<p>
(注意，我不是引战)
</p>

<p>
毕竟可能每个人有自己的思考方式，我在这里只是分享一下我自己的思路，
我写出这个 CPS 程序的经历。当然为了显得我稍微强一点的样子，
我把中间许多非常蠢的错误都省略了。
其实我也不知道我怎么就把这段代码写出来了。
</p>

<p>
我写出这个程序以后，又去看了那篇经典论文
<a href="http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.42.4772">http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.42.4772</a>
这里有一个更友好一点的版本
<a href="http://matt.might.net/articles/cps-conversion/">http://matt.might.net/articles/cps-conversion/</a>
发现我的思路和他的完全不同，我反倒觉得我的思路很清楚，
他的思路我要绕个弯才能看懂，虽然实质上是一样的。
</p>

<p>
这篇文章不涉及什么是 CPS 变换，CPS 变换入门请参考 The Little Schemer，
我直接就开始写 <code>cps</code> 函数了，我们的目标就是王垠的那40行代码，
我也把我自己的程序的变量名什么的都改成了跟那段代码一样的格式，方便对照，
当然也有一些地方不一样，懒得改了。
</p>

<p>
我采用 Racket 语言，就是因为用起来方便一些。就这样了。
</p>
</div>
</div>
