org/cps-converter.org
* 简单的CPS变换

其实一个正确的CPS变换程序，只要学过一点点写解释器的人都会写，
所以我就不细讲了，只是提供一个回忆，你如果要看下去的话最好是这个会自己写。
我们先只考虑λ-calculus的语法，就只有3个分支，变量，λ，函数调用。
先把最简单，没有经过优化的程序写出来。

主要的函数是 =cps1= ，它有两个参数 =expr= 和 =ctx= ，
 =expr= 就是一个s-expression，
 =ctx= 是当前的context，是一个symbol或 ='(λ...)= ，
比如 =(cps1 '(f x) '(λ(x) x))= 的值为
 ='(f x (λ(x) x))= 。所以 =(cps expr)= 函数
就是 =(cps1 expr 'id)= 或 =(cps1 expr '(λ(x) x))= ，
我暂且用前者。

先把用到的辅助函数都列出来
#+BEGIN_SRC racket
 (define (cps expr)
   (define (atom? x)
     (not (pair? x)))
   (define n -1)
   (define (fv)
     (set! n (add1 n))
     (string->symbol (string-append "v" (number->string n))))
   (define (cps1 expr ctx)
     ....)
   (cps1 expr 'id))
#+END_SRC
下面就开始写 =cps1= 

#+BEGIN_SRC racket
 (define (cps1 expr ctx)
   (match expr
     [(? atom? expr) ....]
     [`(λ(,x) ,body) ....]
     [`(,rator ,rand) ....]))
#+END_SRC

第一项，当 =expr= 为一个变量(比如 ='x= )
或一个原始类型(比如 =123= )时，
我们就直接把它返回，比方说，
#+BEGIN_SRC racket
 (cps1 'x 'k) ==> '(k x)
 (cps1 'x '(λ(x) ....))
 ==> '((λ(x) ....) x)
#+END_SRC
因此，
#+BEGIN_SRC racket
 [(? atom? expr) `(,ctx ,expr)]
#+END_SRC
对于一个λ表达式，我们同样直接把它返回，
只是先递归进函数体内，把函数体进行CPS变换。
每个λ的continuation都为 ='k= ，比如，
#+BEGIN_SRC racket
 (cps1 '(λ(x) x) 'id)
 ==> '(id (λ(x k) (k x)))
#+END_SRC
因此，
#+BEGIN_SRC racket
 [`(λ(,x) ,body)
  `(,ctx (λ(,x k) ,(cps1 body 'k)))]
#+END_SRC
处理函数的部分稍微复杂一些，CPS输出应该先分别计算函数和参数，
然后调用，举个例子，在我们最终要完成的代码里，应该大致是这样的，
#+BEGIN_SRC racket
 (cps1 '((f a) (g b)) 'id)
 ==>
 '(f a
     (λ(v0) (g b
               (λ(v1) (v0 v1 id)))))
#+END_SRC
 =v0= 是 =(f a)= 的结果，
 =v1= 是 =(g b)= 的结果，然后调用。

我们先要实现的会产生一些多余代码，比如，
#+BEGIN_SRC racket
 (cps1 '(f x) 'id)
 ==> '((λ(v0)
         ((λ(v1) (v0 v1 id))
          x))
       f)
 <=> '(let ([v0 f])
        (let ([v1 x])
          (v0 v1 id)))
#+END_SRC
可以看出来，我们先分别CPS了 =f= 和 =x= ，
然后调用 =(vf vx ctx)= ，其中 =vf= 和 =vx= 
是我们前面定义的 =(fv)= 产生的，这样保证了每次都不一样。
(说实话 =(gensym)= 也是可以的)
#+BEGIN_SRC racket
 [`(,rator ,rand)
  (define v-rator (fv))
  (define v-rand  (fv))
  (cps1 rator
        `(λ (,v-rator)
           ,(cps1 rand
                  `(λ (,v-rand)
                     (,v-rator ,v-rand ,ctx)))))]
#+END_SRC
于是就全部搞定了。

于是我就兴高采烈地试了一下这个程序，
#+BEGIN_SRC racket
 (cps '((f a) (g b)))
 ==>
 '((λ (v4)
    ((λ (v5)
       (v4
        v5
        (λ (v0)
          ((λ (v2)
             ((λ (v3)
                (v2
                 v3
                 (λ (v1) (v0 v1 id))))
              b))
           g))))
     a))
  f)
#+END_SRC
............

不过算作是个很好的开头吧。

