cps-converter.html

<div id="outline-container-org04d248a" class="outline-2">
<h2 id="org04d248a">简单的CPS变换</h2>
<div class="outline-text-2" id="text-org04d248a">
<p>
其实一个正确的CPS变换程序，只要学过一点点写解释器的人都会写，
所以我就不细讲了，只是提供一个回忆，你如果要看下去的话最好是这个会自己写。
我们先只考虑λ-calculus的语法，就只有3个分支，变量，λ，函数调用。
先把最简单，没有经过优化的程序写出来。
</p>

<p>
主要的函数是 <code>cps1</code> ，它有两个参数 <code>expr</code> 和 <code>ctx</code> ，
 <code>expr</code> 就是一个s-expression，
 <code>ctx</code> 是当前的context，是一个symbol或 <code>'(λ...)</code> ，
比如 <code>(cps1 '(f x) '(λ(x) x))</code> 的值为
 <code>'(f x (λ(x) x))</code> 。所以 <code>(cps expr)</code> 函数
就是 <code>(cps1 expr 'id)</code> 或 <code>(cps1 expr '(λ(x) x))</code> ，
我暂且用前者。
</p>

<p>
先把用到的辅助函数都列出来
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">cps</span> expr<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">atom?</span> x<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">not</span> <span style="color: #97b098;">(</span><span style="color: #262680;">pair?</span> x<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">n</span> <span style="color: #228b22;">-1</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">fv</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">set!</span> n <span style="color: #97b098;">(</span><span style="color: #262680;">add1</span> n<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">string-&gt;symbol</span> <span style="color: #97b098;">(</span><span style="color: #262680;">string-append</span> <span style="color: #228b22;">"v"</span> <span style="color: #aebed8;">(</span><span style="color: #262680;">number-&gt;string</span> n<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">cps1</span> expr ctx<span style="color: #b0b1a3;">)</span>
    ....<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>cps1 expr <span style="color: #228b22;">'id</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
下面就开始写 <code>cps1</code> 
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">cps1</span> expr ctx<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">match</span> expr
    <span style="color: #b0b1a3;">[</span><span style="color: #97b098;">(</span>? atom? expr<span style="color: #97b098;">)</span> ....<span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span>`<span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>,x<span style="color: #aebed8;">)</span> ,body<span style="color: #97b098;">)</span> ....<span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span>`<span style="color: #97b098;">(</span>,rator ,rand<span style="color: #97b098;">)</span> ....<span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
第一项，当 <code>expr</code> 为一个变量(比如 <code>'x</code> )
或一个原始类型(比如 <code>123</code> )时，
我们就直接把它返回，比方说，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps1 <span style="color: #228b22;">'x</span> <span style="color: #228b22;">'k</span><span style="color: #8c8c8c;">)</span> ==&gt; '<span style="color: #8c8c8c;">(</span>k x<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>cps1 <span style="color: #228b22;">'x</span> '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> ....<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> ....<span style="color: #93a8c6;">)</span> x<span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
因此，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span><span style="color: #93a8c6;">(</span>? atom? expr<span style="color: #93a8c6;">)</span> `<span style="color: #93a8c6;">(</span>,ctx ,expr<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
对于一个λ表达式，我们同样直接把它返回，
只是先递归进函数体内，把函数体进行CPS变换。
每个λ的continuation都为 <code>'k</code> ，比如，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps1 '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> x<span style="color: #93a8c6;">)</span> <span style="color: #228b22;">'id</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span>id <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x k<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>k x<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
因此，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>,x<span style="color: #b0b1a3;">)</span> ,body<span style="color: #93a8c6;">)</span>
 `<span style="color: #93a8c6;">(</span>,ctx <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #97b098;">(</span>,x k<span style="color: #97b098;">)</span> ,<span style="color: #97b098;">(</span>cps1 body <span style="color: #228b22;">'k</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
处理函数的部分稍微复杂一些，CPS输出应该先分别计算函数和参数，
然后调用，举个例子，在我们最终要完成的代码里，应该大致是这样的，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps1 '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>f a<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>g b<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #228b22;">'id</span><span style="color: #8c8c8c;">)</span>
==&gt;
'<span style="color: #8c8c8c;">(</span>f a
    <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>g b
              <span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>v1<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span>v0 v1 id<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
<code>v0</code> 是 <code>(f a)</code> 的结果，
<code>v1</code> 是 <code>(g b)</code> 的结果，然后调用。
</p>

<p>
我们先要实现的会产生一些多余代码，比如，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps1 '<span style="color: #93a8c6;">(</span>f x<span style="color: #93a8c6;">)</span> <span style="color: #228b22;">'id</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>v1<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span>v0 v1 id<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         x<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
      f<span style="color: #8c8c8c;">)</span>
&lt;=&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">let</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">[</span><span style="color: black;">v0</span> f<span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span>
       <span style="color: #93a8c6;">(</span><span style="color: #262680;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">[</span><span style="color: black;">v1</span> x<span style="color: #97b098;">]</span><span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>v0 v1 id<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
可以看出来，我们先分别CPS了 <code>f</code> 和 <code>x</code> ，
然后调用 <code>(vf vx ctx)</code> ，其中 <code>vf</code> 和 <code>vx</code> 
是我们前面定义的 <code>(fv)</code> 产生的，这样保证了每次都不一样。
(说实话 <code>(gensym)</code> 也是可以的)
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span>,rator ,rand<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">v-rator</span> <span style="color: #b0b1a3;">(</span>fv<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">v-rand</span>  <span style="color: #b0b1a3;">(</span>fv<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span>cps1 rator
       `<span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #97b098;">(</span>,v-rator<span style="color: #97b098;">)</span>
          ,<span style="color: #97b098;">(</span>cps1 rand
                 `<span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b0b3;">(</span>,v-rand<span style="color: #b0b0b3;">)</span>
                    <span style="color: #b0b0b3;">(</span>,v-rator ,v-rand ,ctx<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
于是就全部搞定了。
</p>

<p>
于是我就兴高采烈地试了一下这个程序，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>f a<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>g b<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt;
'<span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b1a3;">(</span>v4<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #aebed8;">(</span>v5<span style="color: #aebed8;">)</span>
      <span style="color: #aebed8;">(</span>v4
       v5
       <span style="color: #b0b0b3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #90a890;">(</span>v0<span style="color: #90a890;">)</span>
         <span style="color: #90a890;">(</span><span style="color: #a2b6da;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #9cb6ad;">(</span>v2<span style="color: #9cb6ad;">)</span>
            <span style="color: #9cb6ad;">(</span><span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #93a8c6;">(</span>v3<span style="color: #93a8c6;">)</span>
               <span style="color: #93a8c6;">(</span>v2
                v3
                <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #97b098;">(</span>v1<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>v0 v1 id<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
             b<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span>
          g<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
    a<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 f<span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
&#x2026;&#x2026;&#x2026;&#x2026;
</p>

<p>
不过算作是个很好的开头吧。
</p>
</div>
</div>
