org/cps-converter.org
* 最简CPS输出

其实下面才开始真正的任务，上面一节只是因为，
市面上的程序都是分好几个函数，我要把它们合在一起。

上面的程序的问题就在于，当 =ctx= 是 ='(λ(v) ...v...)= ，
而且 =expr= 是一个 ='x= 之类时，输出应该为
 ='...x...= 而不是 ='((λ(v) ...v...) x)= ，
照λ-calculus的术语说就是产生了一个beta-redex。

我们来观察一下现在我们的CPS程序的3个分支产生的ctx

case 1:如果是一个atom，就产生 =`(,ctx ,expr)= ，这时ctx在函数的位置。

case 2:如果是λ表达式，ctx也在函数的位置。

case 3:但如果是函数调用，这时ctx在参数的位置( =(vf vx ctx)= )

很显然，在参数位置时ctx是不可能被化简的，因为结果必须是
 =(vf vx k/id)= 或 =(vf vx (λ(v?) ???))= 
的形式。而在函数位置时是有可能化简的，当它是λ函数的时候。

所以 =ctx= 在函数位置(case 1,2)时应该和case 3统一一下。就是说，
为了化简，我们把 =`(λ(v?) ???)= 
的 =quasiquote= 直接去掉，改成一个函数
 =(λ(v?) `???)= ，调用它就相当于直接把函数体里面的
 =v?= 替换掉了，比如
#+BEGIN_SRC racket
 ;; 原来的输出
 '((λ(v0) (f v0))
   x)
 ;; 现在变成
 ((λ(v) `(f ,v))
  'x)
 ==> '(f x)
#+END_SRC

第二，如果 =ctx= 是 ='k/id= ，
就改成 =(λ(out) `(k/id ,out))= 

因为总共就两种情况: =ctx= 在函数位置和参数位置。
我们不妨把 =cps1= 函数的 =ctx= 参数改成两个，
一个叫 =ctx-f= 在函数位置，一个叫 =ctx-a= 在参数位置。

#+BEGIN_SRC racket
 ;; ctx-f : symbol -> s-exp
 ;; ctx-a : s-exp
 (define (cps1 expr ctx-f ctx-a)
   (match expr
     ....))
 
 (cps1 expr (λ(out) out) 'id)
#+END_SRC

 =(λ(out) out)= 就是 =id= 这个函数。因为原来的
 ='id= 可以看成是 =`(λ(v?) v?)= ，所以化简后
就变成了 =(λ(out) out)= 

接下来就是 =match= 的分支。
#+BEGIN_SRC racket
 [(? atom?) (ctx-f expr)]
 [`(λ(,x) ,body)
  (ctx-f `(λ(,x k) ,(cps1 body
                          (λ(out) `(k ,out))
                          'k)))]
#+END_SRC
这两个应该都是好理解的，都调用了 =ctx-f= 来化简当前的式子。

但是在CPS函数调用时遇到了一些麻烦,因为我们发现总共有4种情况需要讨论，
其中有大量重复的代码，但是不管怎么说，先把代码写出来才是正道
(以下代码会需要一点耐心)
#+BEGIN_SRC racket
[`(,rator ,rand)
 (define v-rator (fv))
 (define v-rand (fv))
 (cps1 rator
       (λ (out-rator)
         (cps1 rand
               (λ (out-rand)
                 `(,out-rator ,out-rand ,ctx-a))
               `(λ (,v-rand)
                  (,out-rator ,v-rand ,ctx-a))))
       `(λ (,v-rator)
          ,(cps1 rand
                 (λ (out-rand)
                   `(,v-rator ,out-rand ,ctx-a))
                 `(λ (,v-rand)
                    (,v-rator ,v-rand ,ctx-a)))))]
#+END_SRC
令人惊讶的是，这个 =cps= 函数就这么完成了!
跟前面的结果对照一下就会看出明显区别了。
它不但可以处理beta-redex，还能正确处理尾递归。

这段代码应该也不难理解，只是分别讨论了函数和参数分别处于函数位置和参数位置的情况。
大致思路就是，首先， =cps1= 要根据 =rator= 和 =rand= 
是否为一个 =atom= 来决定如何输出，其次，我们不愿意在递归进去之前就判断一次，
递归进去之后又要 =match expr= (开头提到的那篇论文的方法就有这个问题)。
所以我们把现在的状态分成了两个参数，也一起递归进去。

它有唯一一个但很好修复的缺陷，就是 =v-rator= 和 =v-rand= 
定义地太早了，所以有时候会出现 =vn= 不连续的情况，
如果不嫌麻烦的话可以在每次第一次出现 =v-?= 的地方再
=(let ([v-? (fv)]) ....)= ，当然这个代码看起来就......
另外，做出了下面一道习题后也会很好修复这个缺陷。

论文里的方法大概就是这样，只是写成了好几个函数
#+BEGIN_SRC racket
 [`(,rator ,rand)
  (if (atom? rator)
      (if (atom? rand)
          ....
          ....)
      (if (atom? rand)
          ....
          ....))]
#+END_SRC
其实这样写也是完全可以的，这时 =cps1= 只需要传一个参数 =ctx-f= 就可以了，
在判断出不是 =atom= 以后用 ='vn= 调用 =ctx-f= ，
把它转换成 =ctx-a= ，这其实更接近王垠的版本。

甚至还有一个写法，就是利用多返回值，再返回一个布尔值表示当前的选择，
这个方法看起来会有些麻烦。就不提了。

现在举两个例子，看一下这个程序是怎么做的，
#+BEGIN_SRC racket
 (cps '(f x))
 ==> (cps1 'f ctx-f ctx-a)
 ==> (ctx-f 'f)
 ==> (cps1 'x .... ....)where[out-rator='f]
 ==> `(,out-rator ,out-rand id)where[out-rator='f out-rand='x]
 ==> '(f x id)
#+END_SRC
但如果没有beta-redex可以化简，比如，
#+BEGIN_SRC racket
 (cps '((f a) b))
 ==> (cps1 '(f a) ctx-f ctx-a)
 ==> `(f a ,ctx-a)where[ctx-a='(λ(v0) (v0 b id))]
 ==> '(f a (λ(v0) (v0 b id)))
#+END_SRC

现在可以来看一下这段代码对我们有什么启发。

所谓的continuation-passing style多用一个参数k来告诉
我们要调用的函数当前的状态是什么，就是这个函数运行完了以后
应该干什么。但这里的 =cps= 函数也有一个参数 =ctx= ，
它也表示一个状态，它表示的是现在的状态，让更深层递归的函数能得知一些外部信息。

很多时候我们发现就传一个死的数据(比如第一个版本里的 =ctx= )
是不够的，不但递归进去的函数需要这个数据，而这个数据也要随着当前的情况而变化。
在简单的情况下我们可以传好几个参数，或者一个对象进去，里面的函数
选择性地使用这些数据。但是在支持高阶函数的语言里很多时候方便很多，
因为我们可以传一个函数进去。

更通常的情况下，上面的 =cps1= 可以只有一个参数 =ctx= ，
其中 =ctx= 是这样的，
#+BEGIN_SRC racket
 ctx=
 (λ(position)
   (cond
     [(eq? position 'f) ....]
     [(eq? position 'a) ....]))
#+END_SRC
这两个分支分别为原来的 =ctx-f= 和 =ctx-a= 。

这种模式更广泛的应用之处在于 =ctx= 的参数不是一个用来选择的符号，
而是一个连续数值或对象的时候。我一下子想不出实际的例子，
有了我会补充。

习题:请扩展这个程序以支持多参数的λ和函数调用。

令我惊讶的是，支持多参数就不用分4类讨论了!
因为只要分两类讨论，依次遍历整个列表就可以，
不用区分函数和参数，所以代码反倒简单多了。
推荐做一下这个习题。

