cps-converter.html

<div id="outline-container-orgf5acf56" class="outline-2">
<h2 id="orgf5acf56">最简CPS输出</h2>
<div class="outline-text-2" id="text-orgf5acf56">
<p>
其实下面才开始真正的任务，上面一节只是因为，
市面上的程序都是分好几个函数，我要把它们合在一起。
</p>

<p>
上面的程序的问题就在于，当 <code>ctx</code> 是 <code>'(λ(v) ...v...)</code> ，
而且 <code>expr</code> 是一个 <code>'x</code> 之类时，输出应该为
 <code>'...x...</code> 而不是 <code>'((λ(v) ...v...) x)</code> ，
照λ-calculus的术语说就是产生了一个beta-redex。
</p>

<p>
我们来观察一下现在我们的CPS程序的3个分支产生的ctx
</p>

<p>
case 1:如果是一个atom，就产生 <code>`(,ctx ,expr)</code> ，这时ctx在函数的位置。
</p>

<p>
case 2:如果是λ表达式，ctx也在函数的位置。
</p>

<p>
case 3:但如果是函数调用，这时ctx在参数的位置( <code>(vf vx ctx)</code> )
</p>

<p>
很显然，在参数位置时ctx是不可能被化简的，因为结果必须是
 <code>(vf vx k/id)</code> 或 <code>(vf vx (λ(v?) ???))</code> 
的形式。而在函数位置时是有可能化简的，当它是λ函数的时候。
</p>

<p>
所以 <code>ctx</code> 在函数位置(case 1,2)时应该和case 3统一一下。就是说，
为了化简，我们把 <code>`(λ(v?) ???)</code> 
的 <code>quasiquote</code> 直接去掉，改成一个函数
 <code>(λ(v?) `???)</code> ，调用它就相当于直接把函数体里面的
 <code>v?</code> 替换掉了，比如
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">&#21407;&#26469;&#30340;&#36755;&#20986;</span>
'<span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>f v0<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  x<span style="color: #8c8c8c;">)</span>
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">&#29616;&#22312;&#21464;&#25104;</span>
<span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v<span style="color: #b0b1a3;">)</span> `<span style="color: #b0b1a3;">(</span>f ,v<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #228b22;">'x</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span>f x<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
第二，如果 <code>ctx</code> 是 <code>'k/id</code> ，
就改成 <code>(λ(out) `(k/id ,out))</code> 
</p>

<p>
因为总共就两种情况: <code>ctx</code> 在函数位置和参数位置。
我们不妨把 <code>cps1</code> 函数的 <code>ctx</code> 参数改成两个，
一个叫 <code>ctx-f</code> 在函数位置，一个叫 <code>ctx-a</code> 在参数位置。
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">ctx-f : symbol -&gt; s-exp</span>
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">ctx-a : s-exp</span>
<span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">cps1</span> expr ctx-f ctx-a<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">match</span> expr
    ....<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>cps1 expr <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>out<span style="color: #b0b1a3;">)</span> out<span style="color: #93a8c6;">)</span> <span style="color: #228b22;">'id</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
 <code>(λ(out) out)</code> 就是 <code>id</code> 这个函数。因为原来的
 <code>'id</code> 可以看成是 <code>`(λ(v?) v?)</code> ，所以化简后
就变成了 <code>(λ(out) out)</code> 
</p>

<p>
接下来就是 <code>match</code> 的分支。
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span><span style="color: #93a8c6;">(</span>? atom?<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span>ctx-f expr<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
<span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>,x<span style="color: #b0b1a3;">)</span> ,body<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span>ctx-f `<span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #97b098;">(</span>,x k<span style="color: #97b098;">)</span> ,<span style="color: #97b098;">(</span>cps1 body
                         <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>out<span style="color: #b0b0b3;">)</span> `<span style="color: #b0b0b3;">(</span>k ,out<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                         <span style="color: #228b22;">'k</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
这两个应该都是好理解的，都调用了 <code>ctx-f</code> 来化简当前的式子。
</p>

<p>
但是在CPS函数调用时遇到了一些麻烦,因为我们发现总共有4种情况需要讨论，
其中有大量重复的代码，但是不管怎么说，先把代码写出来才是正道
(以下代码会需要一点耐心)
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span>,rator ,rand<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">v-rator</span> <span style="color: #b0b1a3;">(</span>fv<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">v-rand</span> <span style="color: #b0b1a3;">(</span>fv<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span>cps1 rator
       <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #97b098;">(</span>out-rator<span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>cps1 rand
               <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b0b3;">(</span>out-rand<span style="color: #b0b0b3;">)</span>
                 `<span style="color: #b0b0b3;">(</span>,out-rator ,out-rand ,ctx-a<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
               `<span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b0b3;">(</span>,v-rand<span style="color: #b0b0b3;">)</span>
                  <span style="color: #b0b0b3;">(</span>,out-rator ,v-rand ,ctx-a<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
       `<span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #97b098;">(</span>,v-rator<span style="color: #97b098;">)</span>
          ,<span style="color: #97b098;">(</span>cps1 rand
                 <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b0b3;">(</span>out-rand<span style="color: #b0b0b3;">)</span>
                   `<span style="color: #b0b0b3;">(</span>,v-rator ,out-rand ,ctx-a<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                 `<span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b0b3;">(</span>,v-rand<span style="color: #b0b0b3;">)</span>
                    <span style="color: #b0b0b3;">(</span>,v-rator ,v-rand ,ctx-a<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
令人惊讶的是，这个 <code>cps</code> 函数就这么完成了!
跟前面的结果对照一下就会看出明显区别了。
它不但可以处理beta-redex，还能正确处理尾递归。
</p>

<p>
这段代码应该也不难理解，只是分别讨论了函数和参数分别处于函数位置和参数位置的情况。
大致思路就是，首先， <code>cps1</code> 要根据 <code>rator</code> 和 <code>rand</code> 
是否为一个 <code>atom</code> 来决定如何输出，其次，我们不愿意在递归进去之前就判断一次，
递归进去之后又要 <code>match expr</code> (开头提到的那篇论文的方法就有这个问题)。
所以我们把现在的状态分成了两个参数，也一起递归进去。
</p>

<p>
它有唯一一个但很好修复的缺陷，就是 <code>v-rator</code> 和 <code>v-rand</code> 
定义地太早了，所以有时候会出现 <code>vn</code> 不连续的情况，
如果不嫌麻烦的话可以在每次第一次出现 <code>v-?</code> 的地方再
<code>(let ([v-? (fv)]) ....)</code> ，当然这个代码看起来就&#x2026;&#x2026;
另外，做出了下面一道习题后也会很好修复这个缺陷。
</p>

<p>
论文里的方法大概就是这样，只是写成了好几个函数
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span>,rator ,rand<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> <span style="color: #b0b1a3;">(</span>atom? rator<span style="color: #b0b1a3;">)</span>
     <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span>atom? rand<span style="color: #97b098;">)</span>
         ....
         ....<span style="color: #b0b1a3;">)</span>
     <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span>atom? rand<span style="color: #97b098;">)</span>
         ....
         ....<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
其实这样写也是完全可以的，这时 <code>cps1</code> 只需要传一个参数 <code>ctx-f</code> 就可以了，
在判断出不是 <code>atom</code> 以后用 <code>'vn</code> 调用 <code>ctx-f</code> ，
把它转换成 <code>ctx-a</code> ，这其实更接近王垠的版本。
</p>

<p>
甚至还有一个写法，就是利用多返回值，再返回一个布尔值表示当前的选择，
这个方法看起来会有些麻烦。就不提了。
</p>

<p>
现在举两个例子，看一下这个程序是怎么做的，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span>f x<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; <span style="color: #8c8c8c;">(</span>cps1 <span style="color: #228b22;">'f</span> ctx-f ctx-a<span style="color: #8c8c8c;">)</span>
==&gt; <span style="color: #8c8c8c;">(</span>ctx-f <span style="color: #228b22;">'f</span><span style="color: #8c8c8c;">)</span>
==&gt; <span style="color: #8c8c8c;">(</span>cps1 <span style="color: #228b22;">'x</span> .... ....<span style="color: #8c8c8c;">)</span>where<span style="color: #8c8c8c;">[</span>out-rator=<span style="color: #228b22;">'f</span><span style="color: #8c8c8c;">]</span>
==&gt; `<span style="color: #8c8c8c;">(</span>,out-rator ,out-rand id<span style="color: #8c8c8c;">)</span>where<span style="color: #8c8c8c;">[</span>out-rator=<span style="color: #228b22;">'f</span> out-rand=<span style="color: #228b22;">'x</span><span style="color: #8c8c8c;">]</span>
==&gt; '<span style="color: #8c8c8c;">(</span>f x id<span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
但如果没有beta-redex可以化简，比如，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>f a<span style="color: #b0b1a3;">)</span> b<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; <span style="color: #8c8c8c;">(</span>cps1 '<span style="color: #93a8c6;">(</span>f a<span style="color: #93a8c6;">)</span> ctx-f ctx-a<span style="color: #8c8c8c;">)</span>
==&gt; `<span style="color: #8c8c8c;">(</span>f a ,ctx-a<span style="color: #8c8c8c;">)</span>where<span style="color: #8c8c8c;">[</span>ctx-a='<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>v0 b id<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
==&gt; '<span style="color: #8c8c8c;">(</span>f a <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>v0 b id<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
现在可以来看一下这段代码对我们有什么启发。
</p>

<p>
所谓的continuation-passing style多用一个参数k来告诉
我们要调用的函数当前的状态是什么，就是这个函数运行完了以后
应该干什么。但这里的 <code>cps</code> 函数也有一个参数 <code>ctx</code> ，
它也表示一个状态，它表示的是现在的状态，让更深层递归的函数能得知一些外部信息。
</p>

<p>
很多时候我们发现就传一个死的数据(比如第一个版本里的 <code>ctx</code> )
是不够的，不但递归进去的函数需要这个数据，而这个数据也要随着当前的情况而变化。
在简单的情况下我们可以传好几个参数，或者一个对象进去，里面的函数
选择性地使用这些数据。但是在支持高阶函数的语言里很多时候方便很多，
因为我们可以传一个函数进去。
</p>

<p>
更通常的情况下，上面的 <code>cps1</code> 可以只有一个参数 <code>ctx</code> ，
其中 <code>ctx</code> 是这样的，
</p>
<div class="org-src-container">
<pre class="src src-racket">ctx=
<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span><span style="color: #93a8c6;">(</span>position<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">cond</span>
    <span style="color: #b0b1a3;">[</span><span style="color: #97b098;">(</span><span style="color: #262680;">eq?</span> position <span style="color: #228b22;">'f</span><span style="color: #97b098;">)</span> ....<span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span><span style="color: #97b098;">(</span><span style="color: #262680;">eq?</span> position <span style="color: #228b22;">'a</span><span style="color: #97b098;">)</span> ....<span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
这两个分支分别为原来的 <code>ctx-f</code> 和 <code>ctx-a</code> 。
</p>

<p>
这种模式更广泛的应用之处在于 <code>ctx</code> 的参数不是一个用来选择的符号，
而是一个连续数值或对象的时候。我一下子想不出实际的例子，
有了我会补充。
</p>

<p>
习题:请扩展这个程序以支持多参数的λ和函数调用。
</p>

<p>
令我惊讶的是，支持多参数就不用分4类讨论了!
因为只要分两类讨论，依次遍历整个列表就可以，
不用区分函数和参数，所以代码反倒简单多了。
推荐做一下这个习题。
</p>
</div>
</div>
