org/cps-converter.org
* 简化 =cps1= 函数

这一节，我们把 =ctx-f= 和 =ctx-a= 合并成一个 =ctx= 

观察所有产生的 =ctx-f/a= 参数，总结一下总共有这些:

1.  =λ(out) `(k ,out)= 

2.  ='k= 

3.  =λ(out) ....`(....,out ....)= 

4.  =`(λ(,vn) ....(....,vn ....))= 

如果要只传一个参数的话，我们会发现，由2可以推出1,
因为我们只要给它包一个 =λ= 就可以了。
由3可以推出4，如果3是 =ctx= ，4就是
 =`(λ(,vn) ,(ctx vn))= 

问题就在于，13是一个形式的，24是一个形式的，
我们要选择的就是只传13还是只传24.

我们发现，13是两个固定的值，而24里面是有一堆省略号的，
也就是说，如果采用一点类似作弊的策略，从1也可以推出2，
只要判断 =ctx= 是否等于 =(λ(out) `(k ,out))= 。
但是无论如何也不可能从任意的4推出3(当然你如果使用 =eval= 
的话，我就没话说了，按理来说是可以的，你可以自己尝试一下，
成功了记得偷偷告诉我一声)。

于是，我们决定采用13型的 =ctx= 。

先写一个转换的函数，把一个13型的 =ctx= 转成24型的。
就是把 =ctx-f= 转成 =ctx-a= 
#+BEGIN_SRC racket
 (define (ctx-f->a ctx)
   (if (ctx1? ctx)
       'k
       (let ([v (fv)])
         `(λ(,v) ,(ctx v)))))
#+END_SRC
但是我们怎样知道一个 =ctx= 是不是 =ctx1?= 呢，
就是不直接写出 =(λ(out) `(k ,out))= ，而是定义
#+BEGIN_SRC racket
 (define ctx1 (λ(out) `(k ,out)))
#+END_SRC
(看到了吗，这就是王垠CPS代码里的 =ctx0= )

于是，
#+BEGIN_SRC racket
 (define (ctx1? ctx) (eq? ctx ctx1))
#+END_SRC

这样完成了之后，原来那段代码所有的 =ctx-a= 都不用手写了，
只要改为 =(ctx-f->a ctx-f)= 就可以了。
因为能这样直接转化，所以也没有必要传两个 =ctx= 参数了，
我们在需要用到 =ctx-a= 时现转化就可以，于是，我们最终得到了这样的代码。
#+BEGIN_SRC racket
 (define (cps1 expr ctx)
   (match expr
     [(? atom? expr) (ctx expr)]
     [`(λ(,x) ,body)
      (ctx `(λ(,x k) ,(cps1 body ctx1)))]
     [`(,rator ,rand)
      (cps1 rator
            (λ (out-rator)
              (cps1 rand
                    (λ (out-rand)
                      `(,out-rator
                        ,out-rand
                        ,(ctx-f->a ctx))))))]))
#+END_SRC
是的，这就是完整的λ-calculus的最简的CPS变换，
如果对照一下王垠的CPS变换的最后几行，你会发现我的这个版本甚至更清晰一些，
因为我用 =ctx-f->a= 这个函数避免了 =`(,out-rator ,out-rand ....)= 
这样重复的代码，并把判断也放进了这个辅助函数中。

你现在可以自己随意试验这个程序了。

下面我们对它进行一些扩展，先增加多参数的λ和函数调用，
然后是原生的几个函数(比如 =+= , =-= , =zero?= 等)，
最后添加if语句。

