cps-converter.html

<div id="outline-container-orge0c8219" class="outline-2">
<h2 id="orge0c8219">简化 <code>cps1</code> 函数</h2>
<div class="outline-text-2" id="text-orge0c8219">
<p>
这一节，我们把 <code>ctx-f</code> 和 <code>ctx-a</code> 合并成一个 <code>ctx</code> 
</p>

<p>
观察所有产生的 <code>ctx-f/a</code> 参数，总结一下总共有这些:
</p>

<ol class="org-ol">
<li><code>λ(out) `(k ,out)</code></li>

<li><code>'k</code></li>

<li><code>λ(out) ....`(....,out ....)</code></li>

<li><code>`(λ(,vn) ....(....,vn ....))</code></li>
</ol>

<p>
如果要只传一个参数的话，我们会发现，由2可以推出1,
因为我们只要给它包一个 <code>λ</code> 就可以了。
由3可以推出4，如果3是 <code>ctx</code> ，4就是
 <code>`(λ(,vn) ,(ctx vn))</code> 
</p>

<p>
问题就在于，13是一个形式的，24是一个形式的，
我们要选择的就是只传13还是只传24.
</p>

<p>
我们发现，13是两个固定的值，而24里面是有一堆省略号的，
也就是说，如果采用一点类似作弊的策略，从1也可以推出2，
只要判断 <code>ctx</code> 是否等于 <code>(λ(out) `(k ,out))</code> 。
但是无论如何也不可能从任意的4推出3(当然你如果使用 <code>eval</code> 
的话，我就没话说了，按理来说是可以的，你可以自己尝试一下，
成功了记得偷偷告诉我一声)。
</p>

<p>
于是，我们决定采用13型的 <code>ctx</code> 。
</p>

<p>
先写一个转换的函数，把一个13型的 <code>ctx</code> 转成24型的。
就是把 <code>ctx-f</code> 转成 <code>ctx-a</code> 
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">ctx-f-&gt;a</span> ctx<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> <span style="color: #b0b1a3;">(</span>ctx1? ctx<span style="color: #b0b1a3;">)</span>
      <span style="color: #228b22;">'k</span>
      <span style="color: #b0b1a3;">(</span><span style="color: #262680;">let</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">[</span><span style="color: black;">v</span> <span style="color: #b0b0b3;">(</span>fv<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">]</span><span style="color: #97b098;">)</span>
        `<span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>,v<span style="color: #aebed8;">)</span> ,<span style="color: #aebed8;">(</span>ctx v<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
但是我们怎样知道一个 <code>ctx</code> 是不是 <code>ctx1?</code> 呢，
就是不直接写出 <code>(λ(out) `(k ,out))</code> ，而是定义
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: black;">ctx1</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>out<span style="color: #b0b1a3;">)</span> `<span style="color: #b0b1a3;">(</span>k ,out<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
(看到了吗，这就是王垠CPS代码里的 <code>ctx0</code> )
</p>

<p>
于是，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">ctx1?</span> ctx<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">eq?</span> ctx ctx1<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
这样完成了之后，原来那段代码所有的 <code>ctx-a</code> 都不用手写了，
只要改为 <code>(ctx-f-&gt;a ctx-f)</code> 就可以了。
因为能这样直接转化，所以也没有必要传两个 <code>ctx</code> 参数了，
我们在需要用到 <code>ctx-a</code> 时现转化就可以，于是，我们最终得到了这样的代码。
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">cps1</span> expr ctx<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">match</span> expr
    <span style="color: #b0b1a3;">[</span><span style="color: #97b098;">(</span>? atom? expr<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>ctx expr<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span>`<span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>,x<span style="color: #aebed8;">)</span> ,body<span style="color: #97b098;">)</span>
     <span style="color: #97b098;">(</span>ctx `<span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>,x k<span style="color: #b0b0b3;">)</span> ,<span style="color: #b0b0b3;">(</span>cps1 body ctx1<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span>`<span style="color: #97b098;">(</span>,rator ,rand<span style="color: #97b098;">)</span>
     <span style="color: #97b098;">(</span>cps1 rator
           <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #b0b0b3;">(</span>out-rator<span style="color: #b0b0b3;">)</span>
             <span style="color: #b0b0b3;">(</span>cps1 rand
                   <span style="color: #90a890;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #a2b6da;">(</span>out-rand<span style="color: #a2b6da;">)</span>
                     `<span style="color: #a2b6da;">(</span>,out-rator
                       ,out-rand
                       ,<span style="color: #9cb6ad;">(</span>ctx-f-&gt;a ctx<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
是的，这就是完整的λ-calculus的最简的CPS变换，
如果对照一下王垠的CPS变换的最后几行，你会发现我的这个版本甚至更清晰一些，
因为我用 <code>ctx-f-&gt;a</code> 这个函数避免了 <code>`(,out-rator ,out-rand ....)</code> 
这样重复的代码，并把判断也放进了这个辅助函数中。
</p>

<p>
你现在可以自己随意试验这个程序了。
</p>

<p>
下面我们对它进行一些扩展，先增加多参数的λ和函数调用，
然后是原生的几个函数(比如 <code>+</code> , <code>-</code> , <code>zero?</code> 等)，
最后添加if语句。
</p>
</div>
</div>
