org/cps-converter.org
* 多参数和原生函数

都已经到这一步了，支持多参数其实很简单。

第一种情况不用变。
#+BEGIN_SRC racket
 [(? atom? expr) (ctx expr)]
#+END_SRC
第二种情况只要把λ的参数改成一个列表就可以了。
#+BEGIN_SRC racket
 [`(λ ,args ,body)
  (ctx `(λ(,@args k) ,(cps1 body ctx1)))]
#+END_SRC
第三种情况甚至只要遍历列表就可以
#+BEGIN_SRC racket
 [_ ; else : expr = `(,rator . ,rands)
  (let recur ([exprs expr] [acc '()])
    (if (null? exprs)
        `(,@acc ,(ctx-f->a ctx))
        (cps1 (car exprs)
              (λ(v) (recur (cdr exprs) `(,@acc ,v))))))]
#+END_SRC
说实话，最后这个递归...我也不知道我自己是怎么写出来的，
思路就是这样，首先最后返回值肯定是\\
 =(cps1 (car exprs) (λ(v) ....))= \\
然后省略号要填的是，递归遍历 =(cdr exprs)= ，所以结构必须是这样的，
#+BEGIN_SRC racket
 (let recur ([exprs expr])
   (cps1 (car exprs) ; when exprs is not null
         (λ (v)
           (recur (cdr exprs))
           (process-v))))
#+END_SRC
然后当 =exprs= 最后变成 =null= 的时候，
我们需要把之前所有的 =v=  :  =v1 v2 v3 ....= 收集起来，
返回 =`(,v1 ,v2 ,v3 .... ,vn ,(ctx-f->a ctx))= ，
因此再多一个变量 =acc= ，用来收集这些 =v= 。
这个程序就完成了。你可以自己试验一下确保它正确。


接下来我们要支持一些原生的函数，比如 =+ - * / zero?= ，
这些函数不需要经过CPS变换，比如，
#+BEGIN_SRC racket
 (cps '(+ x y))
 ;; instead of (+ x y id)
 ==> '(+ x y)

 (cps '(+ (f x) y))
 ==> '(f x (λ(v0) (+ v0 y)))

 (cps '(+ (* x y) z))
 ==> '(+ (* x y) z)

 ;; when used as higher order procedure
 (cps '(((λ(m) +) n) ; returns +
        x y))
 ==> '((λ(m k)
         (k +))
       n
       (λ(v0) (v0 x y id)))
#+END_SRC
首先，
#+BEGIN_SRC racket
 (define (trivial? x)
   (memq x '(zero? add1 sub1 + - * /)))
#+END_SRC

然后，处理函数的不分大多数不变，先在最后进行一个判断。
#+BEGIN_SRC racket
 [_
  (let recur ([exprs expr] [acc '()])
   (if (null? exprs)
       (if (trivial? (car acc))
           ....
           `(,@acc ,(ctx-f->a ctx)))
       (cps1 (car exprs)
             (λ(v) (recur (cdr exprs) `(,@acc ,v))))))]
#+END_SRC
如果 =(car acc)= 是原生函数，就把整体当成一个值返回，所以非常简单，
#+BEGIN_SRC racket
 (if (trivial? (car acc))
     (ctx acc)
     `(,@acc ,(ctx-f->a ctx)))
#+END_SRC
这样就完成了。现在只差最后的难点，就是 =if= 语句了。


