cps-converter.html

<div id="outline-container-orga5f69e4" class="outline-2">
<h2 id="orga5f69e4">多参数和原生函数</h2>
<div class="outline-text-2" id="text-orga5f69e4">
<p>
都已经到这一步了，支持多参数其实很简单。
</p>

<p>
第一种情况不用变。
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span><span style="color: #93a8c6;">(</span>? atom? expr<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span>ctx expr<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
第二种情况只要把λ的参数改成一个列表就可以了。
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span> ,args ,body<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span>ctx `<span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #97b098;">(</span>,@args k<span style="color: #97b098;">)</span> ,<span style="color: #97b098;">(</span>cps1 body ctx1<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
第三种情况甚至只要遍历列表就可以
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span><span style="color: #262680;">_</span> <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">else : expr = `(,rator . ,rands)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">let</span> <span style="color: black;">recur</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">[</span><span style="color: black;">exprs</span> expr<span style="color: #97b098;">]</span> <span style="color: #97b098;">[</span><span style="color: black;">acc</span> '<span style="color: #aebed8;">()</span><span style="color: #97b098;">]</span><span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span><span style="color: #262680;">null?</span> exprs<span style="color: #97b098;">)</span>
       `<span style="color: #97b098;">(</span>,@acc ,<span style="color: #aebed8;">(</span>ctx-f-&gt;a ctx<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
       <span style="color: #97b098;">(</span>cps1 <span style="color: #aebed8;">(</span><span style="color: #262680;">car</span> exprs<span style="color: #aebed8;">)</span>
             <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>v<span style="color: #b0b0b3;">)</span> <span style="color: #b0b0b3;">(</span>recur <span style="color: #90a890;">(</span><span style="color: #262680;">cdr</span> exprs<span style="color: #90a890;">)</span> `<span style="color: #90a890;">(</span>,@acc ,v<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
说实话，最后这个递归&#x2026;我也不知道我自己是怎么写出来的，
思路就是这样，首先最后返回值肯定是<br />
 <code>(cps1 (car exprs) (λ(v) ....))</code> <br />
然后省略号要填的是，递归遍历 <code>(cdr exprs)</code> ，所以结构必须是这样的，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">let</span> <span style="color: black;">recur</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">[</span><span style="color: black;">exprs</span> expr<span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>cps1 <span style="color: #b0b1a3;">(</span><span style="color: #262680;">car</span> exprs<span style="color: #b0b1a3;">)</span> <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">when exprs is not null</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #97b098;">(</span>v<span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span>recur <span style="color: #aebed8;">(</span><span style="color: #262680;">cdr</span> exprs<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span>process-v<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
然后当 <code>exprs</code> 最后变成 <code>null</code> 的时候，
我们需要把之前所有的 <code>v</code>  :  <code>v1 v2 v3 ....</code> 收集起来，
返回 <code>`(,v1 ,v2 ,v3 .... ,vn ,(ctx-f-&gt;a ctx))</code> ，
因此再多一个变量 <code>acc</code> ，用来收集这些 <code>v</code> 。
这个程序就完成了。你可以自己试验一下确保它正确。
</p>


<p>
接下来我们要支持一些原生的函数，比如 <code>+ - * / zero?</code> ，
这些函数不需要经过CPS变换，比如，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">+</span> x y<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">instead of (+ x y id)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">+</span> x y<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">+</span> <span style="color: #b0b1a3;">(</span>f x<span style="color: #b0b1a3;">)</span> y<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span>f x <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">+</span> v0 y<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">+</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">*</span> x y<span style="color: #b0b1a3;">)</span> z<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">+</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">*</span> x y<span style="color: #93a8c6;">)</span> z<span style="color: #8c8c8c;">)</span>

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">when used as higher order procedure</span>
<span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>m<span style="color: #aebed8;">)</span> <span style="color: #262680;">+</span><span style="color: #97b098;">)</span> n<span style="color: #b0b1a3;">)</span> <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">returns +</span>
       x y<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>m k<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>k <span style="color: #262680;">+</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
      n
      <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>v0<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>v0 x y id<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
首先，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">trivial?</span> x<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">memq</span> x '<span style="color: #b0b1a3;">(</span><span style="color: #262680;">zero?</span> <span style="color: #262680;">add1</span> <span style="color: #262680;">sub1</span> <span style="color: #262680;">+</span> <span style="color: #262680;">-</span> <span style="color: #262680;">*</span> <span style="color: #262680;">/</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
然后，处理函数的不分大多数不变，先在最后进行一个判断。
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span><span style="color: #262680;">_</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">let</span> <span style="color: black;">recur</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">[</span><span style="color: black;">exprs</span> expr<span style="color: #97b098;">]</span> <span style="color: #97b098;">[</span><span style="color: black;">acc</span> '<span style="color: #aebed8;">()</span><span style="color: #97b098;">]</span><span style="color: #b0b1a3;">)</span>
  <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span><span style="color: #262680;">null?</span> exprs<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span><span style="color: #262680;">if</span> <span style="color: #aebed8;">(</span>trivial? <span style="color: #b0b0b3;">(</span><span style="color: #262680;">car</span> acc<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
          ....
          `<span style="color: #aebed8;">(</span>,@acc ,<span style="color: #b0b0b3;">(</span>ctx-f-&gt;a ctx<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>cps1 <span style="color: #aebed8;">(</span><span style="color: #262680;">car</span> exprs<span style="color: #aebed8;">)</span>
            <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>v<span style="color: #b0b0b3;">)</span> <span style="color: #b0b0b3;">(</span>recur <span style="color: #90a890;">(</span><span style="color: #262680;">cdr</span> exprs<span style="color: #90a890;">)</span> `<span style="color: #90a890;">(</span>,@acc ,v<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
如果 <code>(car acc)</code> 是原生函数，就把整体当成一个值返回，所以非常简单，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">if</span> <span style="color: #93a8c6;">(</span>trivial? <span style="color: #b0b1a3;">(</span><span style="color: #262680;">car</span> acc<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span>ctx acc<span style="color: #93a8c6;">)</span>
    `<span style="color: #93a8c6;">(</span>,@acc ,<span style="color: #b0b1a3;">(</span>ctx-f-&gt;a ctx<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
这样就完成了。现在只差最后的难点，就是 <code>if</code> 语句了。
</p>
</div>
</div>
