org/cps-converter.org
*  =if= 语句

首先， =if= 语句的不同之处在于，我们需要对它的两个分支做两次CPS变换，
比如，
#+BEGIN_SRC racket
 (cps '(λ(x) (if a b (f c))))
 ==> '(λ(x k) (if a (k b) (f c k)))
#+END_SRC
是的，这个没什么难的，既然都到这里了，应该随手就可以写出来了，
#+BEGIN_SRC racket
 [`(if ,test ,conseq ,alt)
  (cps1 test
        (λ(t) `(if ,t
                   ,(cps1 conseq ctx)
                   ,(cps1 alt ctx))))]
#+END_SRC
把这段代码插到CPS函数调用的前面。我一开始以为就这么完成了，
结果发现，这里的 =ctx= 是会被翻倍的。

如果 =ctx= 是 =k= 的话，没有关系，但是如果是一个比较复杂的式子，
就是说， =if= 语句嵌套在了不是尾递归的地方，比如函数的参数，或 =if= 
的判断语句，就出现了一些问题，
#+BEGIN_SRC racket
 (cps '(λ(x) (f (if a b c))))
 ==> '(λ (x k) (if a (f b k) (f c k)))
#+END_SRC
看起来没什么毛病，但那是因为我们的 =ctx= 太简单了，制造一点更复杂的，
#+BEGIN_SRC racket
 (cps '(λ(x) (f (g (h (if a b c))))))
 ==> '(λ (x k)
        (if a
            (h
             b
             (λ (v0) (g v0 (λ (v1) (f v1 k)))))
            (h
             c
             (λ (v2) (g v2 (λ (v3) (f v3 k)))))))


 (cps '(λ(x) (if (if a b c) d e)))
 ==> '(λ (x k)
        (if a
            (if b (k d) (k e))
            (if c (k d) (k e))))
#+END_SRC
一眼看过去，长得一模一样的代码很多，
第一个例子里面， =(h b/c ....)= 就只有 =b= 和 =c= 不同，
后面完全一样，第二个例子也是这样。

解决方法也很直接，在发现当前的 =ctx= 不是最简的时候，我们用一个 =let= 
包住当前的 =ctx= ，最终结果变成这样，
#+BEGIN_SRC racket
 (cps '(λ(x) (f (if a b c))))
 ==> '(λ(x k)
        (let ([k (λ(v0) (f v0 k))])
          (if a (k b) (k c))))

 (cps '(λ(x) (if (if a b c) d e)))
 ==> '(λ(x k)
        (let ([k (λ(v0) (if v0 (k d) (k e)))])
          (if a (k b) (k c))))
#+END_SRC
 _{(这看起来怎么像是ANF和CPS的混合版)}

所以，也是只要加一个判断即可，
#+BEGIN_SRC racket
 [`(if ,test ,conseq ,alt)
  (define (if-body ctx)
    (cps1 test
          (λ(t) `(if ,t
                     ,(cps1 conseq ctx)
                     ,(cps1 alt ctx)))))
  (if (ctx1? ctx)
      (if-body ctx)
      `(let ([k ,(ctx-f->a ctx)])
         ,(if-body ctx1)))]
#+END_SRC
好了，现在一切都已经完成了。这个教程可以基本圆满地结束了。


那么最后，还有一点小问题可以修复，就是在这种 =ctx= 是 =id= 的时候，
#+BEGIN_SRC racket
 (cps '(if a b c))
 ==> '(let ([k (λ(v0) v0)])
        (if a (k b) (k c)))
#+END_SRC
我们不太希望它只是 =(let ([k id]))= ，而希望直接输出
 =(if a b c)= ，因此，我们把 =id= 也归为一类 =ctx= 
(这应该是第五类了？)，先插入定义
#+BEGIN_SRC racket
 (define id (λ(x) x))
 (define (id? x) (eq? x id))
#+END_SRC
然后把处理 =if= 的代码加上一句，
#+BEGIN_SRC racket
 (if (or (ctx1? ctx)
         (id? ctx))
     (if-body ctx)
     .... as before)
#+END_SRC
最后，
#+BEGIN_SRC racket
 (define (cps expr)
   ....
   (cps1 expr id))
#+END_SRC
就可以了。

再最后，如果有人看着  =(cps '(f x))=  变成  ='(f x (λ(v0) v0))= 
感觉不爽的话，可以这么改一下，
#+BEGIN_SRC racket
 (define (ctx-f->a ctx)
   (cond
     [(ctx1? ctx) 'k]
     [(id? ctx) 'id]
     [else
      (define v (fv))
      `(λ(,v) ,(ctx v))]))
 ;; 话说这里用 case 语句会更舒服一点的...
#+END_SRC
这样， =(cps '(f x))=  就是  ='(f x id)=  啦。

