cps-converter.html


<div id="outline-container-org4a3a1f2" class="outline-2">
<h2 id="org4a3a1f2"><code>if</code> 语句</h2>
<div class="outline-text-2" id="text-org4a3a1f2">
<p>
首先， <code>if</code> 语句的不同之处在于，我们需要对它的两个分支做两次CPS变换，
比如，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> a b <span style="color: #97b098;">(</span>f c<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span><span style="color: #93a8c6;">(</span>x k<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> a <span style="color: #b0b1a3;">(</span>k b<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>f c k<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
是的，这个没什么难的，既然都到这里了，应该随手就可以写出来了，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> ,test ,conseq ,alt<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span>cps1 test
       <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #97b098;">(</span>t<span style="color: #97b098;">)</span> `<span style="color: #97b098;">(</span><span style="color: #262680;">if</span> ,t
                  ,<span style="color: #aebed8;">(</span>cps1 conseq ctx<span style="color: #aebed8;">)</span>
                  ,<span style="color: #aebed8;">(</span>cps1 alt ctx<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
把这段代码插到CPS函数调用的前面。我一开始以为就这么完成了，
结果发现，这里的 <code>ctx</code> 是会被翻倍的。
</p>

<p>
如果 <code>ctx</code> 是 <code>k</code> 的话，没有关系，但是如果是一个比较复杂的式子，
就是说， <code>if</code> 语句嵌套在了不是尾递归的地方，比如函数的参数，或 <code>if</code> 
的判断语句，就出现了一些问题，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>f <span style="color: #97b098;">(</span><span style="color: #262680;">if</span> a b c<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #93a8c6;">(</span>x k<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> a <span style="color: #b0b1a3;">(</span>f b k<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>f c k<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
看起来没什么毛病，但那是因为我们的 <code>ctx</code> 太简单了，制造一点更复杂的，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>f <span style="color: #97b098;">(</span>g <span style="color: #aebed8;">(</span>h <span style="color: #b0b0b3;">(</span><span style="color: #262680;">if</span> a b c<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #93a8c6;">(</span>x k<span style="color: #93a8c6;">)</span>
       <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> a
           <span style="color: #b0b1a3;">(</span>h
            b
            <span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #aebed8;">(</span>v0<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span>g v0 <span style="color: #b0b0b3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #90a890;">(</span>v1<span style="color: #90a890;">)</span> <span style="color: #90a890;">(</span>f v1 k<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>h
            c
            <span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #aebed8;">(</span>v2<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span>g v2 <span style="color: #b0b0b3;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #90a890;">(</span>v3<span style="color: #90a890;">)</span> <span style="color: #90a890;">(</span>f v3 k<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>


<span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span><span style="color: #262680;">if</span> a b c<span style="color: #97b098;">)</span> d e<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span> <span style="color: #93a8c6;">(</span>x k<span style="color: #93a8c6;">)</span>
       <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> a
           <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> b <span style="color: #97b098;">(</span>k d<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>k e<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> c <span style="color: #97b098;">(</span>k d<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>k e<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
一眼看过去，长得一模一样的代码很多，
第一个例子里面， <code>(h b/c ....)</code> 就只有 <code>b</code> 和 <code>c</code> 不同，
后面完全一样，第二个例子也是这样。
</p>

<p>
解决方法也很直接，在发现当前的 <code>ctx</code> 不是最简的时候，我们用一个 <code>let</code> 
包住当前的 <code>ctx</code> ，最终结果变成这样，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>f <span style="color: #97b098;">(</span><span style="color: #262680;">if</span> a b c<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span><span style="color: #93a8c6;">(</span>x k<span style="color: #93a8c6;">)</span>
       <span style="color: #93a8c6;">(</span><span style="color: #262680;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">[</span><span style="color: black;">k</span> <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>v0<span style="color: #b0b0b3;">)</span> <span style="color: #b0b0b3;">(</span>f v0 k<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">]</span><span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> a <span style="color: #97b098;">(</span>k b<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>k c<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span><span style="color: #262680;">if</span> a b c<span style="color: #97b098;">)</span> d e<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">&#955;</span><span style="color: #93a8c6;">(</span>x k<span style="color: #93a8c6;">)</span>
       <span style="color: #93a8c6;">(</span><span style="color: #262680;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">[</span><span style="color: black;">k</span> <span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>v0<span style="color: #b0b0b3;">)</span> <span style="color: #b0b0b3;">(</span><span style="color: #262680;">if</span> v0 <span style="color: #90a890;">(</span>k d<span style="color: #90a890;">)</span> <span style="color: #90a890;">(</span>k e<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">]</span><span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> a <span style="color: #97b098;">(</span>k b<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>k c<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
 <sub>(这看起来怎么像是ANF和CPS的混合版)</sub>
</p>

<p>
所以，也是只要加一个判断即可，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">[</span>`<span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> ,test ,conseq ,alt<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">if-body</span> ctx<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span>cps1 test
         <span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>t<span style="color: #aebed8;">)</span> `<span style="color: #aebed8;">(</span><span style="color: #262680;">if</span> ,t
                    ,<span style="color: #b0b0b3;">(</span>cps1 conseq ctx<span style="color: #b0b0b3;">)</span>
                    ,<span style="color: #b0b0b3;">(</span>cps1 alt ctx<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> <span style="color: #b0b1a3;">(</span>ctx1? ctx<span style="color: #b0b1a3;">)</span>
     <span style="color: #b0b1a3;">(</span>if-body ctx<span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span><span style="color: #262680;">let</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">[</span><span style="color: black;">k</span> ,<span style="color: #b0b0b3;">(</span>ctx-f-&gt;a ctx<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">]</span><span style="color: #97b098;">)</span>
        ,<span style="color: #97b098;">(</span>if-body ctx1<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<p>
好了，现在一切都已经完成了。这个教程可以基本圆满地结束了。
</p>


<p>
那么最后，还有一点小问题可以修复，就是在这种 <code>ctx</code> 是 <code>id</code> 的时候，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span>cps '<span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> a b c<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
==&gt; '<span style="color: #8c8c8c;">(</span><span style="color: #262680;">let</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">[</span><span style="color: black;">k</span> <span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>v0<span style="color: #aebed8;">)</span> v0<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span>
       <span style="color: #93a8c6;">(</span><span style="color: #262680;">if</span> a <span style="color: #b0b1a3;">(</span>k b<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>k c<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
我们不太希望它只是 <code>(let ([k id]))</code> ，而希望直接输出
 <code>(if a b c)</code> ，因此，我们把 <code>id</code> 也归为一类 <code>ctx</code> 
(这应该是第五类了？)，先插入定义
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: black;">id</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> x<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">id?</span> x<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">eq?</span> x id<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
然后把处理 <code>if</code> 的代码加上一句，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">if</span> <span style="color: #93a8c6;">(</span><span style="color: #262680;">or</span> <span style="color: #b0b1a3;">(</span>ctx1? ctx<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>id? ctx<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span>if-body ctx<span style="color: #93a8c6;">)</span>
    .... as before<span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
最后，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">cps</span> expr<span style="color: #93a8c6;">)</span>
  ....
  <span style="color: #93a8c6;">(</span>cps1 expr id<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
<p>
就可以了。
</p>

<p>
再最后，如果有人看着  <code>(cps '(f x))</code>  变成  <code>'(f x (λ(v0) v0))</code> 
感觉不爽的话，可以这么改一下，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">ctx-f-&gt;a</span> ctx<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">cond</span>
    <span style="color: #b0b1a3;">[</span><span style="color: #97b098;">(</span>ctx1? ctx<span style="color: #97b098;">)</span> <span style="color: #228b22;">'k</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span><span style="color: #97b098;">(</span>id? ctx<span style="color: #97b098;">)</span> <span style="color: #228b22;">'id</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">[</span><span style="color: #262680;">else</span>
     <span style="color: #97b098;">(</span><span style="color: #262680;">define</span> <span style="color: black;">v</span> <span style="color: #aebed8;">(</span>fv<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
     `<span style="color: #97b098;">(</span><span style="color: #262680;">&#955;</span><span style="color: #aebed8;">(</span>,v<span style="color: #aebed8;">)</span> ,<span style="color: #aebed8;">(</span>ctx v<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">&#35805;&#35828;&#36825;&#37324;&#29992; case &#35821;&#21477;&#20250;&#26356;&#33298;&#26381;&#19968;&#28857;&#30340;...</span>
</pre>
</div>
<p>
这样， <code>(cps '(f x))</code>  就是  <code>'(f x id)</code>  啦。
</p>
</div>
</div>
