org/cps-converter.org
* 总结

这么多代码看下来，其实你会发现，就只有几个关键点，
只要想到了，其实也没有多难。我自己想这个程序的时候，手头上没有电脑，
我是写在纸上的(好痛苦啊)，但是放到电脑上测试，一次性就全是对的，
毕竟不是很大的工程，也没有各种复杂的角角落落需要考虑，思路还是很简单的。

这个程序还有升级空间，就是  =begin=  和  =set!=  语句，提示一下，
东西越来越复杂的时候，可能不得不回归到第3节中的方式，把各种  =ctx=  拆开，
否则处理  =set!=  的时候会产生一堆嵌套的  =begin=  语句。
另外，如果是Common Lisp里的那种有返回值的赋值语句，处理起来会简单一些，
因为可以简单地看作一个表达式。

最后就随便说说，其实这段代码也没有特别的高级，只是自己写出来了，那就开心一下就好。
代码里倒是有几个挺特别的想法值得学习。

文笔不好请见谅，有任何错误或写的不好的地方欢迎指出。

最后的最后，我把本篇文章完整的代码贴上，
#+BEGIN_SRC racket
 (define (cps expr)
   (define (atom? x)
     (not (pair? x)))
   (define n -1)
   (define (fv)
     (set! n (add1 n))
     (string->symbol (string-append "v" (number->string n))))
   (define ctx1 (λ(out) `(k ,out)))
   (define (ctx1? ctx) (eq? ctx ctx1))
   (define (ctx-f->a ctx)
     (if (ctx1? ctx)
         'k
         (let ([v (fv)])
           `(λ(,v) ,(ctx v)))))
   (define (trivial? x)
     (memq x '(zero? add1 sub1 + - * /)))
   (define id (λ(x) x))
   (define (id? x) (eq? x id))
   (define (cps1 expr ctx)
     (match expr
       [(? atom?) (ctx expr)]
       [`(if ,test ,conseq ,alt)
        (define (if-body ctx)
          (cps1 test
                (λ(t) `(if ,t
                           ,(cps1 conseq ctx)
                           ,(cps1 alt ctx)))))
        (if (or (ctx1? ctx)
                (id? ctx))
            (if-body ctx)
            `(let ([k ,(ctx-f->a ctx)])
               ,(if-body ctx1)))]
       [`(λ ,args ,body)
        (ctx `(λ(,@args k) ,(cps1 body ctx1)))]
       [_
        (let recur ([exprs expr] [acc '()])
          (if (null? exprs)
              (if (trivial? (car acc))
                  (ctx acc)
                  `(,@acc ,(ctx-f->a ctx)))
              (cps1 (car exprs)
                    (λ(v) (recur (cdr exprs) `(,@acc ,v))))))]))
   (cps1 expr id))
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://utteranc.es/client.js"
        repo="yuziwen/yuziwen.github.io"
        issue-term="pathname"
        label="comment"
        theme="github-light"
        crossorigin="anonymous"
        async>
</script>
#+END_EXPORT