cps-converter.html

<div id="outline-container-orge7c93b1" class="outline-2">
<h2 id="orge7c93b1">总结</h2>
<div class="outline-text-2" id="text-orge7c93b1">
<p>
这么多代码看下来，其实你会发现，就只有几个关键点，
只要想到了，其实也没有多难。我自己想这个程序的时候，手头上没有电脑，
我是写在纸上的(好痛苦啊)，但是放到电脑上测试，一次性就全是对的，
毕竟不是很大的工程，也没有各种复杂的角角落落需要考虑，思路还是很简单的。
</p>

<p>
这个程序还有升级空间，就是  <code>begin</code>  和  <code>set!</code>  语句，提示一下，
东西越来越复杂的时候，可能不得不回归到第3节中的方式，把各种  <code>ctx</code>  拆开，
否则处理  <code>set!</code>  的时候会产生一堆嵌套的  <code>begin</code>  语句。
另外，如果是Common Lisp里的那种有返回值的赋值语句，处理起来会简单一些，
因为可以简单地看作一个表达式。
</p>

<p>
最后就随便说说，其实这段代码也没有特别的高级，只是自己写出来了，那就开心一下就好。
代码里倒是有几个挺特别的想法值得学习。
</p>

<p>
文笔不好请见谅，有任何错误或写的不好的地方欢迎指出。
</p>

<p>
最后的最后，我把本篇文章完整的代码贴上，
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #8c8c8c;">(</span><span style="color: #262680;">define</span> <span style="color: #93a8c6;">(</span><span style="color: black;">cps</span> expr<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">atom?</span> x<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">not</span> <span style="color: #97b098;">(</span><span style="color: #262680;">pair?</span> x<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">n</span> <span style="color: #228b22;">-1</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">fv</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">set!</span> n <span style="color: #97b098;">(</span><span style="color: #262680;">add1</span> n<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">string-&gt;symbol</span> <span style="color: #97b098;">(</span><span style="color: #262680;">string-append</span> <span style="color: #228b22;">"v"</span> <span style="color: #aebed8;">(</span><span style="color: #262680;">number-&gt;string</span> n<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">ctx1</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #97b098;">(</span>out<span style="color: #97b098;">)</span> `<span style="color: #97b098;">(</span>k ,out<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">ctx1?</span> ctx<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">eq?</span> ctx ctx1<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">ctx-f-&gt;a</span> ctx<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">if</span> <span style="color: #97b098;">(</span>ctx1? ctx<span style="color: #97b098;">)</span>
        <span style="color: #228b22;">'k</span>
        <span style="color: #97b098;">(</span><span style="color: #262680;">let</span> <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">[</span><span style="color: black;">v</span> <span style="color: #90a890;">(</span>fv<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">]</span><span style="color: #aebed8;">)</span>
          `<span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span><span style="color: #b0b0b3;">(</span>,v<span style="color: #b0b0b3;">)</span> ,<span style="color: #b0b0b3;">(</span>ctx v<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">trivial?</span> x<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">memq</span> x '<span style="color: #97b098;">(</span><span style="color: #262680;">zero?</span> <span style="color: #262680;">add1</span> <span style="color: #262680;">sub1</span> <span style="color: #262680;">+</span> <span style="color: #262680;">-</span> <span style="color: #262680;">*</span> <span style="color: #262680;">/</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: black;">id</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #97b098;">(</span>x<span style="color: #97b098;">)</span> x<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">id?</span> x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #262680;">eq?</span> x id<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b1a3;">(</span><span style="color: black;">cps1</span> expr ctx<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #262680;">match</span> expr
      <span style="color: #97b098;">[</span><span style="color: #aebed8;">(</span>? atom?<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span>ctx expr<span style="color: #aebed8;">)</span><span style="color: #97b098;">]</span>
      <span style="color: #97b098;">[</span>`<span style="color: #aebed8;">(</span><span style="color: #262680;">if</span> ,test ,conseq ,alt<span style="color: #aebed8;">)</span>
       <span style="color: #aebed8;">(</span><span style="color: #262680;">define</span> <span style="color: #b0b0b3;">(</span><span style="color: black;">if-body</span> ctx<span style="color: #b0b0b3;">)</span>
         <span style="color: #b0b0b3;">(</span>cps1 test
               <span style="color: #90a890;">(</span><span style="color: #262680;">&#955;</span><span style="color: #a2b6da;">(</span>t<span style="color: #a2b6da;">)</span> `<span style="color: #a2b6da;">(</span><span style="color: #262680;">if</span> ,t
                          ,<span style="color: #9cb6ad;">(</span>cps1 conseq ctx<span style="color: #9cb6ad;">)</span>
                          ,<span style="color: #9cb6ad;">(</span>cps1 alt ctx<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
       <span style="color: #aebed8;">(</span><span style="color: #262680;">if</span> <span style="color: #b0b0b3;">(</span><span style="color: #262680;">or</span> <span style="color: #90a890;">(</span>ctx1? ctx<span style="color: #90a890;">)</span>
               <span style="color: #90a890;">(</span>id? ctx<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
           <span style="color: #b0b0b3;">(</span>if-body ctx<span style="color: #b0b0b3;">)</span>
           `<span style="color: #b0b0b3;">(</span><span style="color: #262680;">let</span> <span style="color: #90a890;">(</span><span style="color: #a2b6da;">[</span><span style="color: black;">k</span> ,<span style="color: #9cb6ad;">(</span>ctx-f-&gt;a ctx<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">]</span><span style="color: #90a890;">)</span>
              ,<span style="color: #90a890;">(</span>if-body ctx1<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">]</span>
      <span style="color: #97b098;">[</span>`<span style="color: #aebed8;">(</span><span style="color: #262680;">&#955;</span> ,args ,body<span style="color: #aebed8;">)</span>
       <span style="color: #aebed8;">(</span>ctx `<span style="color: #b0b0b3;">(</span><span style="color: #262680;">&#955;</span><span style="color: #90a890;">(</span>,@args k<span style="color: #90a890;">)</span> ,<span style="color: #90a890;">(</span>cps1 body ctx1<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">]</span>
      <span style="color: #97b098;">[</span><span style="color: #262680;">_</span>
       <span style="color: #aebed8;">(</span><span style="color: #262680;">let</span> <span style="color: black;">recur</span> <span style="color: #b0b0b3;">(</span><span style="color: #90a890;">[</span><span style="color: black;">exprs</span> expr<span style="color: #90a890;">]</span> <span style="color: #90a890;">[</span><span style="color: black;">acc</span> '<span style="color: #a2b6da;">()</span><span style="color: #90a890;">]</span><span style="color: #b0b0b3;">)</span>
         <span style="color: #b0b0b3;">(</span><span style="color: #262680;">if</span> <span style="color: #90a890;">(</span><span style="color: #262680;">null?</span> exprs<span style="color: #90a890;">)</span>
             <span style="color: #90a890;">(</span><span style="color: #262680;">if</span> <span style="color: #a2b6da;">(</span>trivial? <span style="color: #9cb6ad;">(</span><span style="color: #262680;">car</span> acc<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span>
                 <span style="color: #a2b6da;">(</span>ctx acc<span style="color: #a2b6da;">)</span>
                 `<span style="color: #a2b6da;">(</span>,@acc ,<span style="color: #9cb6ad;">(</span>ctx-f-&gt;a ctx<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span>
             <span style="color: #90a890;">(</span>cps1 <span style="color: #a2b6da;">(</span><span style="color: #262680;">car</span> exprs<span style="color: #a2b6da;">)</span>
                   <span style="color: #a2b6da;">(</span><span style="color: #262680;">&#955;</span><span style="color: #9cb6ad;">(</span>v<span style="color: #9cb6ad;">)</span> <span style="color: #9cb6ad;">(</span>recur <span style="color: #8c8c8c;">(</span><span style="color: #262680;">cdr</span> exprs<span style="color: #8c8c8c;">)</span> `<span style="color: #8c8c8c;">(</span>,@acc ,v<span style="color: #8c8c8c;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">]</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>cps1 expr id<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<script src="https://utteranc.es/client.js"
        repo="yuziwen/yuziwen.github.io"
        issue-term="pathname"
        label="comment"
        theme="github-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</div>
</div>
</body>
</html>